---
kind: property
id: P:Autodesk.Revit.DB.Viewport.ViewId
source: html/f96f5255-17b5-d4fc-c3a3-049fae1f6eb9.htm
---
# Autodesk.Revit.DB.Viewport.ViewId Property

The element id of the associated View.

## Syntax (C#)
```csharp
public ElementId ViewId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null